Revit 2024 API
DuctSizeIterator.MoveNext Method
 Increments the iterator to the next item.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public virtual bool MoveNext()
Visual Basic
Public Overridable Function MoveNext As Boolean
Visual C++
public:
virtual bool MoveNext()
Return Value
 True if there is a next available item in this iterator. False if the iterator has completed all available items.
See Also
DuctSizeIterator Class
Autodesk.Revit.DB.Mechanical Namespace